# Flip Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wall..::..Flip Method
Wall Class See Also
---
The wall orientation will be flipped.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Flip()
```

Visual Basic
---
```text
Public Sub Flip
```

Visual C++
---
```text
public:
void Flip()
```

# See Also
Wall Class
Autodesk.Revit.DB Namespace